Revit 2026 API

# SolidSolidCutUtilsSplitFacesOfCuttingSolid Method

---

Causes the faces of the cutting element where it intersects the element it is cutting to be split or unsplit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void SplitFacesOfCuttingSolid(
	Element first,
	Element second,
	bool split
)
```
```vb
Public Shared Sub SplitFacesOfCuttingSolid (
	first As Element,
	second As Element,
	split As Boolean
)
```
```cpp
public:
static void SplitFacesOfCuttingSolid(
	Element^ first,
	Element^ second,
	bool split
)
```
```fsharp
static member SplitFacesOfCuttingSolid :
        first : Element *
        second : Element *
        split : bool -> unit
```

#### Parameters

first Element
     The solid being cut or the cutting solid
second Element
     The solid being cut or the cutting solid
split Boolean
     True to split the faces of intersection, false to unsplit them.

| Exception | Condition |
| --- | --- |
| ArgumentException | There is no solid-solid cut between the input elements. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Unable to split or unsplit faces of cutting solid |

There must be a cut between the input elements.

#### Reference

SolidSolidCutUtils Class

Autodesk.Revit.DB Namespace